
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_function.lambda_cfupdater will be updated in-place
  ~ resource "aws_lambda_function" "lambda_cfupdater" {
      ~ filename                       = "./artifacts/lambda/cfupdater.zip" -> "./src/lambda/cfupdater.zip"
        id                             = "hosting-temp-lambda-cfupdater"
      ~ last_modified                  = "2025-12-21T04:16:26.361+0000" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group_rule.sgrule_main_ipv4 will be created
  + resource "aws_security_group_rule" "sgrule_main_ipv4" {
      + cidr_blocks              = [
          + (sensitive value),
        ]
      + description              = "Allow Admin Access"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "eu-south-2"
      + security_group_id        = "sg-0426b10def3f8365f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # null_resource.null_ansible_main will be destroyed
  # (because null_resource.null_ansible_main is not in configuration)
  - resource "null_resource" "null_ansible_main" {
      - id       = "733483659594356665" -> null
      - triggers = {
          - "ansible_tree_sha" = "d77710c492d8771ebb223c62d547801b93ae0398fd8d4918ca6004adcbf48159"
          - "instance_id"      = "i-0ca681d3705c25799"
        } -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.
